configuration/src/Documents/ВнутреннееЗадание/ВнутреннееЗадание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВнутреннееЗадание</name>
  <basedOn>Catalog.Проекты</basedOn>
  <basedOn>Document.ВнутреннееЗадание</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПроцесса</name>
    <type>
      <types>EnumRef.ВидыПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРодительскогоПроекта</name>
    <type>
      <types>CatalogRef.ВидыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияСтатуса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРазработки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоИзменения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоТестирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексируемоеОписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсполнитьДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КороткийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Назначена</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.НазначенияЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.НаправленияРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектОснование</name>
    <comment>Ссылка на другой объект БД, которому подчинен текущий объект</comment>
    <type>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановоеНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <comment>Порядок задачи в общей очереди</comment>
    <type>
      <types>DefinedType.ПорядокВОчереди</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Продукт</name>
    <type>
      <types>CatalogRef.Продукты</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентВыполнения</name>
    <comment>Процент выполнения с шагом 10</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерьезностьОшибки</name>
    <type>
      <types>CatalogRef.СерьезностьОшибок</types>
    </type>
  </attributes>
  <attributes>
    <name>СистемаУчета</name>
    <type>
      <types>CatalogRef.СистемыУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеЛицо</name>
    <comment>Служит для передачи значения от проекта к заявке. Не зависит от выбранного направления. Не отображается на форме</comment>
    <type>
      <types>CatalogRef.ЮридическиеЛица</types>
    </type>
  </attributes>
</mdclass:Document>

configuration/src/InformationRegisters/СвойстваВнутреннихЗаданий/СвойстваВнутреннихЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвойстваВнутреннихЗаданий</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Порядок</name>
    <type>
      <types>DefinedType.ПорядокВОчереди</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыОбъектов</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.ВнутреннееЗадание</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Catalogs/СтатусыОбъектов/СтатусыОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатусыОбъектов</name>
  <comment>Хранит  элементы, соответствующие определенным статусам объектов.</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>CodeReview</name>
      <description>Code review</description>
    </items>
    <items>
      <name>DesignReview</name>
      <description>Design review</description>
    </items>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>ВРеализацию</name>
      <description>В реализацию</description>
    </items>
    <items>
      <name>Внедрение</name>
      <description>Внедрение</description>
    </items>
    <items>
      <name>ВнутреннееТестирование</name>
      <description>Внутреннее тестирование</description>
    </items>
    <items>
      <name>Документирование</name>
      <description>Документирование</description>
    </items>
    <items>
      <name>ЗапросТребований</name>
      <description>Запрос требований</description>
    </items>
    <items>
      <name>Масштабирование</name>
      <description>Масштабирование</description>
    </items>
    <items>
      <name>НаДоработку</name>
      <description>На доработку</description>
    </items>
    <items>
      <name>Рассмотрение</name>
      <description>На рассмотрении</description>
    </items>
    <items>
      <name>Новый</name>
      <description>Новый</description>
    </items>
    <items>
      <name>Отклонен</name>
      <description>Отклонен</description>
    </items>
    <items>
      <name>Отложен</name>
      <description>Отложен</description>
    </items>
    <items>
      <name>Приостановлен</name>
      <description>Приостановлен</description>
    </items>
    <items>
      <name>Проработка</name>
      <description>Проработка</description>
    </items>
    <items>
      <name>Протестирован</name>
      <description>Протестирован</description>
    </items>
    <items>
      <name>Публикация</name>
      <description>Публикация</description>
    </items>
    <items>
      <name>Рассмотрен</name>
      <description>Рассмотрен</description>
    </items>
    <items>
      <name>РевьюТребований</name>
      <description>Ревью требований</description>
    </items>
    <items>
      <name>Решен</name>
      <description>Решен</description>
    </items>
    <items>
      <name>Тестирование</name>
      <description>Тестирование</description>
    </items>
  </predefined>
  <attributes>
    <name>ИмяКартинкиВБиблиотеке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексЗафиксирован</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <comment>Индекс изображения в общей картинке СтатусыОбъектов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <comment>Порядковый номер статуса</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПричиныИзмененияСтатуса</name>
    <attributes>
      <name>Причина</name>
      <type>
        <types>CatalogRef.ПричиныИзмененияСтатусов</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Documents/ВнутреннееЗадание/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Возвращает список подключаемых команды панели навигации
// 
// Возвращаемое значение:
//   Список значенией - список подключаемых команды панели навигации
//
Функция КомандыПанелиНавигации() Экспорт

	Команды = Новый СписокЗначений;   
	Команды.Добавить("История", "История", , БиблиотекаКартинок.ПанельНавигацииИстория);
	Команды.Добавить("Участники", "Участники", , БиблиотекаКартинок.Участники);	
	Команды.Добавить("Комментарии", "Комментарии", , БиблиотекаКартинок.Комментарии);
	Команды.Добавить("ЗаинтересованныеЛица", "Заинтересованные лица", , БиблиотекаКартинок.ЗаинтересованныеЛица);
	Команды.Добавить("Файлы", "Файлы", , БиблиотекаКартинок.Файлы);
	Команды.Добавить("Связи", "Связи", , БиблиотекаКартинок.Связи); 
	Команды.Добавить("ПланПроекта", "План проекта", , БиблиотекаКартинок.ПланПроекта);
	Команды.Добавить("СтруктураПодчиненности", "Структура подчиненности", , БиблиотекаКартинок.СтруктураПодчиненности);
	ИнтеграцияДополнительныхПодсистем.ДобавитьКомандуРасчетПриоритета(Команды);
	
	Возврат Команды;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Общие процедуры и функции

Функция ПолучитьПрефикс() Экспорт
	
	Возврат "ВЗ";
	
КонецФункции

// Функция - Получить назначеного
//
// Параметры:
//  Статус		 - Справочник.СтатусыОбъектов			 - статус документа
//  Ссылка		 - Документ.ВнутреннееЗадание			 - ссылка на документ
//  Направление	 - СправочникСсылка.НаправленияРазработки	 - направление документа
//  Заказчик	 - СправочникСсылка.Пользователи			 - заказчик докумена
//  Назначена	 - СправочникСсылка.Пользователи			 - новый назначенный в документе
// 
// Возвращаемое значение:
//  Назначена - назначенный при изменении статуса
//
Функция ПолучитьНазначеного(Знач Статус, Знач Ссылка, Знач Направление, Знач Заказчик, Знач Назначена) Экспорт
	
	НовыйИсполнитель = Назначена;  
	Статусы = Справочники.СтатусыОбъектов;

	// При статусах "Тестирование" и "НаДоработку" задача возвращается на заказчика.
	Если Статус = Статусы.Тестирование 
		ИЛИ Статус = Статусы.НаДоработку Тогда
		
		НовыйИсполнитель = Заказчик;
		
	ИначеЕсли Статус = Статусы.ВРаботе
		ИЛИ Статус = Статусы.Протестирован Тогда
		
		// Если текущий пользователь - тестировщик, ИЛИ статус изменился на "В работе" задача возвращается на последнего исполнителя
		ПоследнийРазработчик = ПолучитьПоследнегоРазработчика(Ссылка, Направление);
		Если ЗначениеЗаполнено(ПоследнийРазработчик) Тогда
			НовыйИсполнитель = ПоследнийРазработчик;
		КонецЕсли;
	КонецЕсли; 
	
	Возврат НовыйИсполнитель;
	
КонецФункции
	
// Возвращает максимально допустимый уровень вложенности 
// 
// Возвращаемое значение:
//   - Число
//
Функция МаксимальныйУровеньВложенности() Экспорт
	
	Возврат 3;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ИСТОРИЯ ИЗМЕНЕНИЙ ОБЪЕКТА, ОПОВЕЩЕНИЕ ПОЛЬЗОВАТЕЛЕЙ

Функция ПроверяемыеСвойстваОбъекта() Экспорт
	
	Результат = Новый Структура("Реквизиты, ТабличныеЧасти", Новый Массив, Новый Структура);
	
	// Названия реквизитов объекта
	Результат.Реквизиты.Добавить("Филиал");
	Результат.Реквизиты.Добавить("ДатаЗакрытия");
	Результат.Реквизиты.Добавить("ДатаПоследнегоТестирования");
	Результат.Реквизиты.Добавить("ДатаНачалаРазработки");
	Результат.Реквизиты.Добавить("ОбъектОснование");
	Результат.Реквизиты.Добавить("Заказчик");
	Результат.Реквизиты.Добавить("ИсполнитьДо");
	Результат.Реквизиты.Добавить("Назначена");
	Результат.Реквизиты.Добавить("Назначение");
	Результат.Реквизиты.Добавить("Наименование");
	Результат.Реквизиты.Добавить("Направление");
	Результат.Реквизиты.Добавить("Описание");
	Результат.Реквизиты.Добавить("Порядок");
	Результат.Реквизиты.Добавить("Проект");
	Результат.Реквизиты.Добавить("СистемаУчета");
	Результат.Реквизиты.Добавить("Статус");
	Результат.Реквизиты.Добавить("Продукт");
	Результат.Реквизиты.Добавить("ЮридическоеЛицо");
	
	Возврат Результат;
	
КонецФункции

Функция АвтосохраняемыеРеквизиты() Экспорт
	
	СохраняемыеДанные = Новый Структура;
	
	СохраняемыеДанные.Вставить("РеквизитыОбъекта", Новый Массив);
	СохраняемыеДанные.Вставить("ТабличныеЧасти", Новый Структура);
	СохраняемыеДанные.Вставить("РеквизитыФормы", Новый Массив);
	
	СохраняемыеДанные.РеквизитыОбъекта.Добавить("Наименование");
	СохраняемыеДанные.РеквизитыОбъекта.Добавить("Приоритет");
	СохраняемыеДанные.РеквизитыОбъекта.Добавить("Назначена");
	СохраняемыеДанные.РеквизитыОбъекта.Добавить("СерьезностьОшибки");
	СохраняемыеДанные.РеквизитыОбъекта.Добавить("ОбъектОснование");
	СохраняемыеДанные.РеквизитыОбъекта.Добавить("Назначение");
	СохраняемыеДанные.РеквизитыОбъекта.Добавить("ВидПроцесса");
	СохраняемыеДанные.РеквизитыОбъекта.Добавить("Направление");
	СохраняемыеДанные.РеквизитыОбъекта.Добавить("Заказчик");
	СохраняемыеДанные.РеквизитыОбъекта.Добавить("Филиал");
	СохраняемыеДанные.РеквизитыФормы.Добавить("ПланТрудозатрат");
	
	Возврат СохраняемыеДанные;
	
КонецФункции

// Массив имен реквизитов, тексты которых подвергаются семантическому контролю
// 
// Возвращаемое значение:
//  Массив - имена реквизитов, подвергающиеся семантическому анализу
//
Функция РеквизитыСемантическогоАнализа() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить("Описание");
	Массив.Добавить("Наименование");
	
	Возврат Массив;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Номер");
	Поля.Добавить("Наименование");	
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = СтрШаблон("Внутреннее задание %1. %2", Данные.Номер, Данные.Наименование);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Устанавливает ограничения использования полей в динамических списках 
// документа "Задача".
//
// Параметры:
//  Список - ДинамическийСписок - динамический список.
Процедура УстановитьОграниченияСписка(Список) Экспорт
	
	// Поля, исключаемые из отбора, сортировки и группировки
	ИсключаемыеПоля = Новый Массив;
	ИсключаемыеПоля.Добавить("ИндексКартинки");
	ИсключаемыеПоля.Добавить("ПометкаУдаления");
	ИсключаемыеПоля.Добавить("Проведен");
	ИсключаемыеПоля.Добавить("Порядок");	
	
	Список.УстановитьОграниченияИспользованияВОтборе(ИсключаемыеПоля);
	
	ИсключаемыеПоля.Добавить("Ссылка");
	
	Список.УстановитьОграниченияИспользованияВПорядке(ИсключаемыеПоля);
	Список.УстановитьОграниченияИспользованияВГруппировке(ИсключаемыеПоля);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПоследнегоРазработчика(Знач Ссылка, Знач Направление)
	
	Результат = Справочники.Пользователи.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СвойстваВнутреннихЗаданий.Исполнитель КАК Исполнитель
	|ИЗ
	|	РегистрСведений.СвойстваВнутреннихЗаданий КАК СвойстваВнутреннихЗаданий
	|ГДЕ
	|	СвойстваВнутреннихЗаданий.Объект = &Ссылка
	|	И СвойстваВнутреннихЗаданий.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыОбъектов.ВРаботе)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СвойстваВнутреннихЗаданий.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Направление", Направление);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Исполнитель;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
